Actually Im super suprised because I've checked many versions: like
- 1.49.1
- 1.49.0
- 1.40
- 1.25.0
- and finally 1.0.0 which worked...
```hcl
  # databricks_storage_credential.main_test will be created
  + resource "databricks_storage_credential" "main_test" {
      + id           = (known after apply)
      + metastore_id = (known after apply)
      + name         = "test"
      + owner        = (known after apply)

      + azure_managed_identity {
          + access_connector_id = "/subscriptions/<snip>/resourceGroups/databricks/providers/Microsoft.Databricks/accessConnectors/test-connector"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

databricks_storage_credential.main_test: Creating...
databricks_storage_credential.main_test: Creation complete after 3s [id=test]
```

but I would like to use the latest one, not 2 years old version. What changed here? The config of resource is the same.